{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  },
  "orig_nbformat": 2,
  "kernelspec": {
   "name": "python385jvsc74a57bd0916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1",
   "display_name": "Python 3.8.5 64-bit"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "source": [
    "Goal of this notebook:\n",
    " - Implement a way of representing types by having an edge going into a vertex that holds a type\n",
    " - Implement shortest path queries that avoid vertices connected to a specific vertex of a particular type"
   ],
   "cell_type": "markdown",
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "[v[557096], v[418032], v[422128], v[41390216], v[421920], v[446632]]\n"
     ]
    }
   ],
   "source": [
    "# Jupyter notebook needs this or else it will crash\n",
    "import nest_asyncio\n",
    "nest_asyncio.apply()\n",
    "\n",
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "from gremlin_python.process.traversal import P # NEW!!! Import predicates (gt, gte, lt, lte, etc.)\n",
    "from gremlin_python.process.traversal import Cardinality # NEW!!! Import Cardinality such as list_, set_ and single.\n",
    "from gremlin_python.driver.protocol import GremlinServerError # Gremlin server error\n",
    "from gremlin_python.process.traversal import Pop # for Pop.all_ in select(Pop.all_, 'v')\n",
    "\n",
    "# Instantiate a Gremlin Graph\n",
    "graph = Graph()\n",
    "\n",
    "# Connect to the server, instantiate traversal of graph.\n",
    "g = graph.traversal().withRemote(DriverRemoteConnection('ws://localhost:8182/gremlin','g'))\n",
    "\n",
    "# Get the vertices of the graph as a list, and print them.\n",
    "\n",
    "print(g.V().toList())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [],
   "source": [
    "def connected(name1: str, name2: str, time: float) -> bool:\n",
    "    \"\"\"\n",
    "    Given two vertices labelled with <name1> and <name2>, determine whether they were connected at time <time>. \n",
    "    Do so by sending a Gremlin query to determine whether there exists an edge between the \n",
    "    two vertices such that <time> falls in between their \"start_time\" and \"end_time\" parameters.\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    # Get the vertices associated with the names\n",
    "    # v1, v2 = g.V().has('name', name1).next(), g.V().has('name', name2).next()\n",
    "\n",
    "    # Return whether there are edges that:\n",
    "    #   - connect v1 and v2, \n",
    "    #   - labelled 'connection',\n",
    "    #   - have a start time that is less than or equal to <time>\n",
    "    #   - either do not have an end time or have an end time that is greater than or equal to <time>\n",
    "    return g.V().has('name', name1).bothE('connection').as_('e').bothV().has('name', name2).select('e').and_(\n",
    "            __.has('start', P.lte(time)),   # want start time to be less than or equal to <time>\n",
    "            __.or_(\n",
    "                __.hasNot('end'),           # end time doesn't have to exist \n",
    "                __.has('end', P.gt(time))  # OR end time must be greater than <time>\n",
    "            )\n",
    "        ).count().next() > 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [],
   "source": [
    "def set_connection(name1: str, name2: str, time: float, connection: bool) -> None:\n",
    "    \"\"\"\n",
    "    Given two vertices labelled with <name1> and <name2>, create a new connection or terminate their existing connection, based on the value of <bool>. Label with time <time>.\n",
    "\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    if connection:\n",
    "        if not connected(name1, name2, time):\n",
    "\n",
    "            # Add an edge labelled 'connection' with a start time of <time>\n",
    "            g.V().has('name', name1).as_(\"a\").V().has('name', name2).as_(\"b\").addE('connection').from_(\"a\").to(\"b\").property('start', time).iterate()\n",
    "\n",
    "    else:\n",
    "        # For all edges between v1 and v2 labelled 'connection' (there should only be one) that do not have an 'end' property, create an end property of <time>.\n",
    "        g.V().has('name', name1).bothE('connection').as_('e').bothV().has('name', name2).select('e').hasNot('end').property('end', time).iterate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [],
   "source": [
    "def set_type(name: str, type: str) -> None:\n",
    "    \"\"\"\n",
    "    Connect the vertex labelled with <name> to a vertex labelled <type> with an edge going into the <type> vertex labelled with \"type\".\n",
    "\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    g.V().has('name', name).as_(\"a\").V().has('name', type).as_(\"b\").addE(\"type\").from_(\"a\").to(\"b\").iterate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "# This will put it in V-E-V-E-V-...-V form as a list per path.\n",
    "def find_paths(name1: str, name2: str, avoid_type: str, time: float):\n",
    "    \"\"\"\n",
    "    Given two vertices labelled with <name1> and <name2>, return the paths that connect the vertices by edges that were active at <time> as a list.\n",
    "\n",
    "    Avoid vertices of type avoid_type.\n",
    "\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    return g.V().has('name', name1).repeat(\n",
    "            __.bothE().and_(\n",
    "                __.has('start', P.lte(time)),   # want start time to be less than or equal to <time>\n",
    "                __.or_(\n",
    "                    __.hasNot('end'),           # end time doesn't have to exist \n",
    "                    __.has('end', P.gt(time))  # OR end time must be greater than <time>\n",
    "                )\n",
    "            ).otherV().not_(__.outE('type').inV().has('name', avoid_type)).simplePath()\n",
    "        ).until(__.has('name', name2)).path().toList()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "v1 v[454720]\n",
      "v2 v[41455800]\n",
      "v3 v[884832]\n",
      "v4 v[41394312]\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc817a610>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc80292b0>\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc822fd90>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc8164040>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc817a490>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc81e14f0>\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc81e5e20>\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7fbcc817ab20>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7fbcc8d37b80>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "///// 0 /////\n",
      "\n",
      "///// 1 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "\n",
      "///// 2 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "\n",
      "///// 3 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rw94-9qv4-1lh-iyqo'}}][454720-connection->884832], v[884832], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'pa047-ooji0-1lh-iyqo'}}][41455800-connection->884832], v[41455800]]\n",
      "\n",
      "///// 4 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rw94-9qv4-1lh-iyqo'}}][454720-connection->884832], v[884832], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'pa047-ooji0-1lh-iyqo'}}][41455800-connection->884832], v[41455800]]\n",
      "\n",
      "///// 5 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "\n",
      "///// 6 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "\n",
      "///// 7 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "\n",
      "///// 8 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "\n",
      "///// 9 /////\n",
      "[v[454720], e[{'@type': 'janusgraph:RelationIdentifier', '@value': {'relationId': 'rvuw-9qv4-1lh-ooji0'}}][454720-connection->41455800], v[41455800]]\n",
      "\n",
      "///// 10 /////\n",
      "\n",
      "///// 11 /////\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Drop all vertices.\n",
    "g.V().drop().iterate()\n",
    "\n",
    "g.addV().property('name', 'TYPE1').iterate()\n",
    "g.addV().property('name', 'TYPE2').iterate()\n",
    "\n",
    "for i in range(1, 5):\n",
    "    print(f\"v{i}\", g.addV().property('name', f'v{i}').next())\n",
    "\n",
    "set_type('v1', 'TYPE1')\n",
    "set_type('v2', 'TYPE1')\n",
    "set_type('v3', 'TYPE1')\n",
    "set_type('v4', 'TYPE2')\n",
    "\n",
    "# Connect v1 and v2 at time 1. Disconnect at time 10.\n",
    "set_connection('v1', 'v2', 1, True)\n",
    "set_connection('v1', 'v2', 10, False)\n",
    "\n",
    "# Connect v1 and v3 at time 2, disconnect at time 4.\n",
    "set_connection('v1', 'v3', 2, True)\n",
    "set_connection('v1', 'v3', 5, False)\n",
    "\n",
    "# Connect v2 and v3 at time 3, disconnect at time 7.\n",
    "set_connection('v2', 'v3', 3, True)\n",
    "set_connection('v3', 'v3', 7, False)\n",
    "\n",
    "# Connect v1 and v4 at time 1, disconnect at time 7.\n",
    "set_connection('v1', 'v4', 1, True)\n",
    "set_connection('v1', 'v4', 7, False)\n",
    "\n",
    "# Connect v4 and v2 at time 2, disconnect at time 9.\n",
    "set_connection('v4', 'v2', 2, True)\n",
    "set_connection('v4', 'v2', 9, False)\n",
    "\n",
    "# EXPORT THE GRAPH.\n",
    "g.io(\"avoid_vertices_graph.xml\").write().iterate()\n",
    "\n",
    "for time in range(0, 12):\n",
    "    print(f\"///// {time} /////\")\n",
    "    for arr in find_paths(name1='v1', name2='v2', avoid_type='TYPE2', time=time):\n",
    "        print(list(arr))\n",
    "    print()"
   ]
  }
 ]
}