{"cells":[{"cell_type":"code","execution_count":42,"metadata":{},"outputs":[],"source":["import nest_asyncio\n","nest_asyncio.apply()"]},{"cell_type":"code","execution_count":43,"metadata":{},"outputs":[{"output_type":"stream","name":"stdout","text":["[v[8320]]\n"]}],"source":["from gremlin_python import statics\n","from gremlin_python.structure.graph import Graph\n","from gremlin_python.process.graph_traversal import __\n","from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n","\n","# Instantiate a Gremlin Graph\n","graph = Graph()\n","\n","# Connect to the server, instantiate traversal of graph.\n","g = graph.traversal().withRemote(DriverRemoteConnection('ws://localhost:8182/gremlin','g'))\n","\n","# Get the vertices of the graph as a list, and print them.\n","v = g.V().toList()\n","print(v)\n"]},{"cell_type":"code","execution_count":44,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["{'properties': [\"[{'timestamp': '2021-05-12 11:07:17', 'active': True}]\"],\n"," 'name': ['ANT000000']}"]},"metadata":{},"execution_count":44}],"source":["g.V().valueMap().next()"]},{"cell_type":"code","execution_count":45,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'properties': [\"[{'timestamp': '2021-05-12 11:07:17', 'active': True}]\"],\n","  'name': ['ANT000000']}]"]},"metadata":{},"execution_count":45}],"source":["g.V().valueMap().toList()"]},{"cell_type":"code","execution_count":46,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[v[8320]]"]},"metadata":{},"execution_count":46}],"source":["g.V().toList()"]},{"source":["## Note!\n","This will remove all vertices from the graph."],"cell_type":"markdown","metadata":{}},{"cell_type":"code","execution_count":47,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[['V'], ['drop'], ['none'], ['values', '_ipython_canary_method_should_not_exist_'], ['values', '_ipython_canary_method_should_not_exist_']]"]},"metadata":{},"execution_count":47}],"source":["g.V().drop().iterate()"]},{"cell_type":"code","execution_count":48,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":48}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":49,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[4264]"]},"metadata":{},"execution_count":49}],"source":["g.addV('antenna').next()"]},{"cell_type":"code","execution_count":50,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[v[4264]]"]},"metadata":{},"execution_count":50}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":51,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{}]"]},"metadata":{},"execution_count":51}],"source":["g.V().valueMap().toList()"]},{"cell_type":"code","execution_count":52,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":52}],"source":["g.V('antenna').valueMap().toList()"]},{"cell_type":"code","execution_count":53,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[['V'], ['drop'], ['none'], ['values', '_ipython_canary_method_should_not_exist_'], ['values', '_ipython_canary_method_should_not_exist_']]"]},"metadata":{},"execution_count":53}],"source":["g.V().drop().iterate()"]},{"cell_type":"code","execution_count":54,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":54}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":55,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[12416]"]},"metadata":{},"execution_count":55}],"source":["from datetime import datetime\n","now = datetime.now()\n","dt_string = now.strftime(\"%Y-%m-%d %H:%M:%S\")\n","props = [\n","    {\n","        \"timestamp\": dt_string,\n","        \"active\": True\n","    }\n","]\n","g.addV().property('name', 'ANT000000').property('properties', str(props)).next()"]},{"cell_type":"code","execution_count":56,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[v[12416]]"]},"metadata":{},"execution_count":56}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":57,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[12416]"]},"metadata":{},"execution_count":57}],"source":["g.V().property('name', 'ANT000000').next()"]},{"cell_type":"code","execution_count":58,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'name': ['ANT000000'],\n","  'properties': [\"[{'timestamp': '2021-05-12 11:07:36', 'active': True}]\"]}]"]},"metadata":{},"execution_count":58}],"source":["g.V().property('name', 'ANT000000').valueMap().toList()"]},{"source":["Looks like setting a property will overwrite it, even though it's stored in a list..."],"cell_type":"markdown","metadata":{}},{"cell_type":"code","execution_count":59,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'name': ['ANT000000'],\n","  'properties': [\"[{'timestamp': '2021-05-12 11:07:37', 'active': False}]\"]}]"]},"metadata":{},"execution_count":59}],"source":["from datetime import datetime\n","now = datetime.now()\n","dt_string = now.strftime(\"%Y-%m-%d %H:%M:%S\")\n","\n","ant = g.V().property('name', 'ANT000000')\n","props = [\n","    {\n","        \"timestamp\": dt_string,\n","        \"active\": False\n","    }\n","]\n","ant.property('properties', str(props)).next()\n","\n","g.V().property('name', 'ANT000000').valueMap().toList()"]}],"nbformat":4,"nbformat_minor":2,"metadata":{"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.8.5"},"orig_nbformat":2,"kernelspec":{"name":"python385jvsc74a57bd0916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1","display_name":"Python 3.8.5 64-bit"},"metadata":{"interpreter":{"hash":"916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"}}}}