{"cells":[{"cell_type":"code","execution_count":86,"metadata":{},"outputs":[],"source":["import nest_asyncio\n","nest_asyncio.apply()"]},{"cell_type":"code","execution_count":87,"metadata":{},"outputs":[{"output_type":"stream","name":"stdout","text":["[v[12336], v[20720], v[16552], v[8296], v[12416], v[8368], v[12392], v[8240], v[12456]]\n"]}],"source":["from gremlin_python import statics\n","from gremlin_python.structure.graph import Graph\n","from gremlin_python.process.graph_traversal import __\n","from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n","\n","# Instantiate a Gremlin Graph\n","graph = Graph()\n","\n","# Connect to the server, instantiate traversal of graph.\n","g = graph.traversal().withRemote(DriverRemoteConnection('ws://localhost:8182/gremlin','g'))\n","\n","# Get the vertices of the graph as a list, and print them.\n","v = g.V().toList()\n","print(v)\n"]},{"cell_type":"code","execution_count":88,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["{'code': ['KAUS']}"]},"metadata":{},"execution_count":88}],"source":["g.V().valueMap().next()"]},{"cell_type":"code","execution_count":89,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'code': ['KAUS']},\n"," {'code': ['KAUS']},\n"," {'code1': ['KAUS']},\n"," {'hello': ['KAUS']},\n"," {'test': [2], 'prop': [345876386]},\n"," {'test': [2], 'prop': [345876386]},\n"," {'properties': ['2'], 'prop': [345876386], 'name': ['ANT000000']},\n"," {'test1': [2.5749], 'prop': [345876386]},\n"," {'prop': [345876386]}]"]},"metadata":{},"execution_count":89}],"source":["g.V().valueMap().toList()"]},{"cell_type":"code","execution_count":90,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[v[12336],\n"," v[20720],\n"," v[16552],\n"," v[8296],\n"," v[12416],\n"," v[8368],\n"," v[12392],\n"," v[8240],\n"," v[12456]]"]},"metadata":{},"execution_count":90}],"source":["g.V().toList()"]},{"source":["## Note!\n","This will remove all vertices from the graph."],"cell_type":"markdown","metadata":{}},{"cell_type":"code","execution_count":91,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[['V'], ['drop'], ['none'], ['values', '_ipython_canary_method_should_not_exist_'], ['values', '_ipython_canary_method_should_not_exist_']]"]},"metadata":{},"execution_count":91}],"source":["g.V().drop().iterate()"]},{"cell_type":"code","execution_count":92,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":92}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":93,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[24816]"]},"metadata":{},"execution_count":93}],"source":["g.addV('antenna').next()"]},{"cell_type":"code","execution_count":94,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[v[24816]]"]},"metadata":{},"execution_count":94}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":95,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{}]"]},"metadata":{},"execution_count":95}],"source":["g.V().valueMap().toList()"]},{"cell_type":"code","execution_count":96,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":96}],"source":["g.V('antenna').valueMap().toList()"]},{"cell_type":"code","execution_count":97,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[['V'], ['drop'], ['none'], ['values', '_ipython_canary_method_should_not_exist_'], ['values', '_ipython_canary_method_should_not_exist_']]"]},"metadata":{},"execution_count":97}],"source":["g.V().drop().iterate()"]},{"cell_type":"code","execution_count":98,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":98}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":99,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[4152]"]},"metadata":{},"execution_count":99}],"source":["from datetime import datetime\n","now = datetime.now()\n","dt_string = now.strftime(\"%Y-%m-%d %H:%M:%S\")\n","props = [\n","    {\n","        \"timestamp\": dt_string,\n","        \"active\": True\n","    }\n","]\n","g.addV().property('name', 'ANT000000').property('properties', str(props)).next()"]},{"cell_type":"code","execution_count":100,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[v[4152]]"]},"metadata":{},"execution_count":100}],"source":["g.V().toList()"]},{"cell_type":"code","execution_count":101,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[4152]"]},"metadata":{},"execution_count":101}],"source":["g.V().property('name', 'ANT000000').next()"]},{"cell_type":"code","execution_count":102,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'name': ['ANT000000'],\n","  'properties': [\"[{'timestamp': '2021-05-12 13:18:49', 'active': True}]\"]}]"]},"metadata":{},"execution_count":102}],"source":["g.V().property('name', 'ANT000000').valueMap().toList()"]},{"source":["Looks like setting a property will overwrite it, even though it's stored in a list..."],"cell_type":"markdown","metadata":{}},{"cell_type":"code","execution_count":103,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'name': ['ANT000000'], 'properties': ['2']}]"]},"metadata":{},"execution_count":103}],"source":["import datetime as dt\n","\n","ant = g.V().property('name', 'ANT000000')\n","props = [\n","    {\n","        \"timestamp\": str(dt.datetime(1997, 6, 6, 23, 19, 48)),\n","        \"active\": False\n","    },\n","    {\n","        \"timestamp\": str(dt.datetime(2002, 8, 10, 2, 48, 47)),\n","        \"active\": True\n","    },\n","    {\n","        \"timestamp\": str(dt.datetime(2002, 8, 10, 2, 48, 49)),\n","        \"active\": False\n","    },\n","    {\n","        \"timestamp\": str(dt.datetime(2011, 7, 20, 20, 11, 10)),\n","        \"active\": False\n","    },\n","]\n","ant.property('properties', 2).next()\n","\n","g.V().property('name', 'ANT000000').valueMap().toList()"]},{"cell_type":"code","execution_count":104,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'properties': ['2'], 'name': ['ANT000000']}, {'test': [2]}]"]},"metadata":{},"execution_count":104}],"source":["g.addV().property('test', 2).next()\n","g.V().valueMap().toList()"]},{"cell_type":"code","execution_count":105,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[16432]"]},"metadata":{},"execution_count":105}],"source":["g.addV().property('test1', 2.5749).next()"]},{"cell_type":"code","execution_count":106,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[28912]"]},"metadata":{},"execution_count":106}],"source":["g.addV().property('prop', 345876386).next()"]},{"cell_type":"code","execution_count":107,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["v[20608]"]},"metadata":{},"execution_count":107}],"source":["g.addV().property('code','AUS').property('code','KAUS').next()"]},{"cell_type":"code","execution_count":108,"metadata":{},"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'code': ['KAUS']},\n"," {'prop': [345876386]},\n"," {'test1': [2.5749]},\n"," {'properties': ['2'], 'name': ['ANT000000']},\n"," {'test': [2]}]"]},"metadata":{},"execution_count":108}],"source":["g.V().valueMap().toList()"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":[]}],"nbformat":4,"nbformat_minor":2,"metadata":{"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.8.5"},"orig_nbformat":2,"kernelspec":{"name":"python385jvsc74a57bd0916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1","display_name":"Python 3.8.5 64-bit"},"metadata":{"interpreter":{"hash":"916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"}}}}