{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  },
  "orig_nbformat": 2,
  "kernelspec": {
   "name": "python385jvsc74a57bd0916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1",
   "display_name": "Python 3.8.5 64-bit"
  },
  "metadata": {
   "interpreter": {
    "hash": "916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Jupyter notebook needs this or else it will crash\n",
    "import nest_asyncio\n",
    "nest_asyncio.apply()\n",
    "\n",
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "from gremlin_python.process.traversal import P # NEW!!! Import predicates (gt, gte, lt, lte, etc.)\n",
    "from gremlin_python.process.traversal import Cardinality # NEW!!! Import Cardinality such as list_, set_ and single.\n",
    "from gremlin_python.driver.protocol import GremlinServerError # Gremlin server error\n",
    "from gremlin_python.process.traversal import Pop # for Pop.all_ in select(Pop.all_, 'v')\n",
    "\n",
    "# Instantiate a Gremlin Graph\n",
    "graph = Graph()\n",
    "\n",
    "# Connect to the server, instantiate traversal of graph.\n",
    "g = graph.traversal().withRemote(DriverRemoteConnection('ws://localhost:8182/gremlin','g'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "def connected(name1: str, name2: str, time: float) -> bool:\n",
    "    \"\"\"\n",
    "    Given two vertices labelled with <name1> and <name2>, determine whether they were connected at time <time>. \n",
    "    Do so by sending a Gremlin query to determine whether there exists an edge between the \n",
    "    two vertices such that <time> falls in between their \"start_time\" and \"end_time\" parameters.\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    # Get the vertices associated with the names\n",
    "    # v1, v2 = g.V().has('name', name1).next(), g.V().has('name', name2).next()\n",
    "\n",
    "    # Return whether there are edges that:\n",
    "    #   - connect v1 and v2, \n",
    "    #   - labelled 'connection',\n",
    "    #   - have a start time that is less than or equal to <time>\n",
    "    #   - either do not have an end time or have an end time that is greater than or equal to <time>\n",
    "    return g.V().has('name', name1).bothE('connection').as_('e').bothV().has('name', name2).select('e').and_(\n",
    "            __.has('start', P.lte(time)),   # want start time to be less than or equal to <time>\n",
    "            __.or_(\n",
    "                __.hasNot('end'),           # end time doesn't have to exist \n",
    "                __.has('end', P.gt(time))  # OR end time must be greater than <time>\n",
    "            )\n",
    "        ).count().next() > 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "def set_connection(name1: str, name2: str, time: float, connection: bool) -> None:\n",
    "    \"\"\"\n",
    "    Given two vertices labelled with <name1> and <name2>, create a new connection or terminate their existing connection, based on the value of <bool>. Label with time <time>.\n",
    "\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    success = False\n",
    "\n",
    "    while not success:\n",
    "\n",
    "        try:\n",
    "\n",
    "            if connection:\n",
    "                # Add an edge labelled 'connection' with a start time of <time>\n",
    "                g.V().has('name', name1).not_( # NEGATE \n",
    "                    __.bothE('connection').as_('e').bothV().has('name', name2).select('e').and_(\n",
    "                        __.has('start', P.lte(time)),\n",
    "                        __.or_(\n",
    "                            __.hasNot('end'),\n",
    "                            __.has('end', P.gt(time))\n",
    "                        )\n",
    "                    )\n",
    "                ).V().has('name', name1).as_(\"a\").V().has('name', name2).as_(\"b\").addE('connection').from_(\"a\").to(\"b\").property('start', time).iterate()\n",
    "\n",
    "            else:\n",
    "                # For all edges between v1 and v2 labelled 'connection' (there should only be one) that do not have an 'end' property, create an end property of <time>.\n",
    "                g.V().has('name', name1).bothE('connection').as_('e').bothV().has('name', name2).select('e').hasNot('end').property('end', time).iterate()\n",
    "        \n",
    "            success = True\n",
    "\n",
    "        except GremlinServerError:\n",
    "            print(\"Oops! Backend error!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_type(type: str) -> None:\n",
    "    \"\"\"\n",
    "    Add a vertex to the graph with a 'type' property of <type>.\n",
    "\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    g.addV().property('name', type).iterate()\n",
    "\n",
    "def set_type(name: str, type: str) -> None:\n",
    "    \"\"\"\n",
    "    Connect the vertex labelled with <name> to a vertex labelled <type> with an edge going into the <type> vertex labelled with \"type\".\n",
    "\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    g.V().has('name', name).as_(\"a\").V().has('name', type).as_(\"b\").addE(\"type\").from_(\"a\").to(\"b\").iterate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "# This will put it in V-E-V-E-V-...-V form as a list per path.\n",
    "def find_paths(name1: str, name2: str, avoid_type: str, time: float):\n",
    "    \"\"\"\n",
    "    Given two vertices labelled with <name1> and <name2>, return the paths that connect the vertices by edges that were active at <time> as a list.\n",
    "\n",
    "    Avoid vertices of type avoid_type.\n",
    "\n",
    "    TODO: Add sphinx documentation if this will be implemented into the actual Python library.\n",
    "    \"\"\"\n",
    "\n",
    "    return g.V().has('name', name1).repeat(\n",
    "            __.bothE('connection').and_(\n",
    "                __.has('start', P.lte(time)),   # want start time to be less than or equal to <time>\n",
    "                __.or_(\n",
    "                    __.hasNot('end'),           # end time doesn't have to exist \n",
    "                    __.has('end', P.gt(time))  # OR end time must be greater than <time>\n",
    "                )\n",
    "            ).otherV().not_(__.outE('type').inV().has('name', avoid_type)).simplePath()\n",
    "        ).until(__.has('name', name2)).path().toList()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Dish 1 done, took 3.165289\n",
      "Dish 2 done, took 1.860513\n",
      "Dish 3 done, took 1.674536\n",
      "Dish 4 done, took 0.935674\n",
      "Dish 5 done, took 0.865013\n",
      "Dish 6 done, took 0.857534\n",
      "Dish 7 done, took 0.861199\n",
      "Dish 8 done, took 1.023952\n",
      "Dish 9 done, took 0.993023\n",
      "Dish 10 done, took 0.998995\n",
      "Dish 11 done, took 0.940345\n",
      "Dish 12 done, took 0.8225\n",
      "Dish 13 done, took 0.881127\n",
      "Dish 14 done, took 0.821426\n",
      "Dish 15 done, took 0.831011\n",
      "Dish 16 done, took 0.899568\n",
      "Dish 17 done, took 0.897668\n",
      "Dish 18 done, took 0.894811\n",
      "Dish 19 done, took 0.916137\n",
      "Dish 20 done, took 0.906023\n",
      "Dish 21 done, took 0.950398\n",
      "Dish 22 done, took 0.899105\n",
      "Dish 23 done, took 0.910906\n",
      "Dish 24 done, took 0.977578\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7f3a44dc59a0>\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7f3a44de1340>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7f3a47fdd0d0>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7f3a44dd3df0>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7f3a47fdd0d0>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x7f3a44cffd30>\n",
      "Exception ignored in: <function ClientResponse.__del__ at 0x7f3a47fdd0d0>\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_reqrep.py\", line 803, in __del__\n",
      "    self._connection.release()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 170, in release\n",
      "    self._connector._release(\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/connector.py\", line 650, in _release\n",
      "    protocol.close()\n",
      "  File \"/home/azszavyalov/.local/lib/python3.8/site-packages/aiohttp/client_proto.py\", line 63, in close\n",
      "    transport.close()\n",
      "  File \"/usr/lib/python3.8/asyncio/selector_events.py\", line 690, in close\n",
      "    self._loop.call_soon(self._call_connection_lost, None)\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 719, in call_soon\n",
      "    self._check_closed()\n",
      "  File \"/usr/lib/python3.8/asyncio/base_events.py\", line 508, in _check_closed\n",
      "    raise RuntimeError('Event loop is closed')\n",
      "RuntimeError: Event loop is closed\n",
      "Dish 25 done, took 1.049958\n",
      "Dish 26 done, took 1.040774\n",
      "Dish 27 done, took 1.023633\n",
      "Dish 28 done, took 1.043818\n",
      "Dish 29 done, took 1.036074\n",
      "Dish 30 done, took 1.041259\n",
      "Dish 31 done, took 1.055002\n",
      "Dish 32 done, took 1.144857\n",
      "Dish 33 done, took 1.14491\n",
      "Dish 34 done, took 1.215548\n",
      "Dish 35 done, took 1.2055\n",
      "Dish 36 done, took 1.220709\n",
      "Dish 37 done, took 1.211572\n",
      "Dish 38 done, took 1.23698\n",
      "Dish 39 done, took 1.227286\n",
      "Dish 40 done, took 1.286706\n",
      "Dish 41 done, took 1.293246\n",
      "Dish 42 done, took 1.341098\n",
      "Dish 43 done, took 1.319898\n",
      "Dish 44 done, took 1.351251\n",
      "Dish 45 done, took 1.330396\n",
      "Dish 46 done, took 1.395569\n",
      "Dish 47 done, took 1.379267\n",
      "Dish 48 done, took 1.351237\n",
      "Dish 49 done, took 1.431123\n",
      "Dish 50 done, took 1.464245\n",
      "Dish 51 done, took 1.451275\n",
      "Dish 52 done, took 1.4594\n",
      "Dish 53 done, took 1.468359\n",
      "Dish 54 done, took 1.493634\n",
      "Dish 55 done, took 1.486493\n",
      "Dish 56 done, took 1.478021\n",
      "Dish 57 done, took 1.512414\n",
      "Dish 58 done, took 1.607788\n",
      "Dish 59 done, took 1.577615\n",
      "Dish 60 done, took 1.607458\n",
      "Dish 61 done, took 1.641439\n",
      "Dish 62 done, took 1.622398\n",
      "Dish 63 done, took 1.641354\n",
      "Dish 64 done, took 1.714693\n",
      "Dish 65 done, took 1.671463\n",
      "Dish 66 done, took 1.775802\n",
      "Dish 67 done, took 1.779379\n",
      "Dish 68 done, took 1.762993\n",
      "Dish 69 done, took 1.776374\n",
      "Dish 70 done, took 1.809887\n",
      "Dish 71 done, took 1.786136\n",
      "Dish 72 done, took 1.801796\n",
      "Dish 73 done, took 1.831764\n",
      "Dish 74 done, took 1.900269\n",
      "Dish 75 done, took 1.966221\n",
      "Dish 76 done, took 1.921345\n",
      "Dish 77 done, took 1.980094\n",
      "Dish 78 done, took 1.997388\n",
      "Dish 79 done, took 1.944471\n",
      "Dish 80 done, took 1.985523\n",
      "Dish 81 done, took 1.970918\n",
      "Dish 82 done, took 1.974289\n",
      "Dish 83 done, took 2.087869\n",
      "Dish 84 done, took 2.07758\n",
      "Dish 85 done, took 2.112776\n",
      "Dish 86 done, took 2.105804\n",
      "Dish 87 done, took 2.109299\n",
      "Dish 88 done, took 2.119636\n",
      "Dish 89 done, took 2.138007\n",
      "Dish 90 done, took 2.146721\n",
      "Dish 91 done, took 2.205695\n",
      "Dish 92 done, took 2.222603\n",
      "Dish 93 done, took 2.241556\n",
      "Dish 94 done, took 2.257491\n",
      "Dish 95 done, took 2.250026\n",
      "Dish 96 done, took 2.23993\n",
      "Dish 97 done, took 2.274975\n",
      "Dish 98 done, took 2.303973\n",
      "Dish 99 done, took 2.355459\n",
      "Dish 100 done, took 2.353483\n",
      "Dish 101 done, took 2.370722\n",
      "Dish 102 done, took 2.395935\n",
      "Dish 103 done, took 2.414048\n",
      "Dish 104 done, took 2.40409\n",
      "Dish 105 done, took 2.402293\n",
      "Dish 106 done, took 2.419761\n",
      "Dish 107 done, took 2.417877\n",
      "Dish 108 done, took 2.513916\n",
      "Dish 109 done, took 2.514807\n",
      "Dish 110 done, took 2.562116\n",
      "Dish 111 done, took 2.559364\n",
      "Dish 112 done, took 2.584516\n",
      "Dish 113 done, took 2.621519\n",
      "Dish 114 done, took 2.593094\n",
      "Dish 115 done, took 2.591962\n",
      "Dish 116 done, took 2.689119\n",
      "Dish 117 done, took 2.736916\n",
      "Dish 118 done, took 2.721918\n",
      "Dish 119 done, took 2.726267\n",
      "Dish 120 done, took 2.72418\n",
      "Dish 121 done, took 2.74285\n",
      "Dish 122 done, took 2.77309\n",
      "Dish 123 done, took 2.752845\n",
      "Dish 124 done, took 2.849006\n",
      "Dish 125 done, took 2.842836\n",
      "Dish 126 done, took 2.874768\n",
      "Dish 127 done, took 2.897115\n",
      "Dish 128 done, took 2.896709\n"
     ]
    }
   ],
   "source": [
    "import datetime\n",
    "\n",
    "# Clear vertices\n",
    "g.V().drop().iterate()\n",
    "g.E().drop().iterate()\n",
    "\n",
    "\"\"\"\n",
    "(Temporary) Naming scheme:\n",
    " - COR######: Correlator input\n",
    " - ANT######: Antenna\n",
    " - DPF######: Dual-Polarization Feed\n",
    " - BLN######: (Active) Balun\n",
    " - RFT######: RFoF transmitter\n",
    " - OPF######: Optical Fiber\n",
    " - RFR######: RFoF receiver\n",
    " - ADC######: Analog-to-Digital converter\n",
    "\"\"\"\n",
    "\n",
    "# Set up the types\n",
    "types = ['COR', 'ANT', 'DPF', 'BLN', 'RFT', 'OPF', 'RFR', 'ADC']\n",
    "for type in types:\n",
    "    add_type(type)\n",
    "\n",
    "\n",
    "# Correlator node name\n",
    "cor = 'COR000000'\n",
    "\n",
    "# Add a correlator input node\n",
    "g.addV().property('name', cor).iterate()\n",
    "set_type(cor, 'COR')\n",
    "\n",
    "# number of HIRAX dishes\n",
    "dishes = 512\n",
    "\n",
    "# Connections at every 3.\n",
    "max_time = 30\n",
    "connections = [(i, bool(i % 2)) for i in range(0, max_time // 3 + 1, 3)]\n",
    "\n",
    "\n",
    "# Add the components and connect them at different times.\n",
    "for i in range(1, dishes + 1):\n",
    "\n",
    "    now = datetime.datetime.now()\n",
    "\n",
    "    # The names of the components to refer to\n",
    "    ant = f'ANT{str(i).zfill(6)}'\n",
    "    dpf = f'DPF{str(i).zfill(6)}'\n",
    "    bln = (f'BLN{str(2 * i - 1).zfill(6)}', f'BLN{str(2 * i).zfill(6)}')\n",
    "    rft = (f'RFT{str(2 * i - 1).zfill(6)}', f'RFT{str(2 * i).zfill(6)}')\n",
    "    opf = (f'OPF{str(2 * i - 1).zfill(6)}', f'OPF{str(2 * i).zfill(6)}')\n",
    "    rfr = (f'RFR{str(2 * i - 1).zfill(6)}', f'RFR{str(2 * i).zfill(6)}')\n",
    "    adc = (f'ADC{str(2 * i - 1).zfill(6)}', f'ADC{str(2 * i).zfill(6)}')\n",
    "\n",
    "    g.addV().property('name', ant).iterate()\n",
    "    g.addV().property('name', dpf).iterate()\n",
    "\n",
    "    set_type(ant, 'ANT')\n",
    "    set_type(dpf, 'DPF')\n",
    "\n",
    "    for ind in (0, 1):\n",
    "        g.addV().property('name', bln[ind]).iterate()\n",
    "        g.addV().property('name', rft[ind]).iterate()\n",
    "        g.addV().property('name', opf[ind]).iterate()\n",
    "        g.addV().property('name', rfr[ind]).iterate()\n",
    "        g.addV().property('name', adc[ind]).iterate()\n",
    "\n",
    "        set_type(bln[ind], 'BLN')\n",
    "        set_type(rft[ind], 'RFT')\n",
    "        set_type(opf[ind], 'OPF')\n",
    "        set_type(rfr[ind], 'RFR')\n",
    "        set_type(adc[ind], 'ADC')\n",
    "\n",
    "    for (time, connection) in connections:\n",
    "\n",
    "        set_connection(name1=ant, name2=dpf, time=time, connection=connection)\n",
    "\n",
    "        for ind in (0, 1):\n",
    "\n",
    "            # Pairs of names to connect\n",
    "            pairs = [(ant, dpf), (dpf, bln[ind]), (bln[ind], rft[ind]), (rft[ind], opf[ind]), (opf[ind], rfr[ind]), (rfr[ind], adc[ind]), (adc[ind], cor)]\n",
    "\n",
    "            for pair in pairs:\n",
    "                set_connection(name1=pair[0], name2=pair[1], time=time, connection=connection)\n",
    "\n",
    "    print(f\"Dish {i} done, took {(datetime.datetime.now() - now).total_seconds()}\")\n",
    "\n",
    "\n",
    "\n",
    "# EXPORT THE GRAPH.\n",
    "# g.io(\"path_benchmark_small_graph.xml\").write().iterate()\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Dishes: 128\n",
      "Max time: 30\n",
      "Iterations: 1\n",
      "Dish 0 done\n",
      "Dish 1 done\n",
      "Dish 2 done\n",
      "Dish 3 done\n",
      "Dish 4 done\n",
      "Dish 5 done\n",
      "Dish 6 done\n",
      "Dish 7 done\n",
      "Dish 8 done\n",
      "Dish 9 done\n",
      "Dish 10 done\n",
      "Dish 11 done\n",
      "Dish 12 done\n",
      "Dish 13 done\n",
      "Dish 14 done\n",
      "Dish 15 done\n",
      "Dish 16 done\n",
      "Dish 17 done\n",
      "Dish 18 done\n",
      "Dish 19 done\n",
      "Dish 20 done\n",
      "Dish 21 done\n",
      "Dish 22 done\n",
      "Dish 23 done\n",
      "Dish 24 done\n",
      "Dish 25 done\n",
      "Dish 26 done\n",
      "Dish 27 done\n",
      "Dish 28 done\n",
      "Dish 29 done\n",
      "Dish 30 done\n",
      "Dish 31 done\n",
      "Dish 32 done\n",
      "Dish 33 done\n",
      "Dish 34 done\n",
      "Dish 35 done\n",
      "Dish 36 done\n",
      "Dish 37 done\n",
      "Dish 38 done\n",
      "Dish 39 done\n",
      "Dish 40 done\n",
      "Dish 41 done\n",
      "Dish 42 done\n",
      "Dish 43 done\n",
      "Dish 44 done\n",
      "Dish 45 done\n",
      "Dish 46 done\n",
      "Dish 47 done\n",
      "Dish 48 done\n",
      "Dish 49 done\n",
      "Dish 50 done\n",
      "Dish 51 done\n",
      "Dish 52 done\n",
      "Dish 53 done\n",
      "Dish 54 done\n",
      "Dish 55 done\n",
      "Dish 56 done\n",
      "Dish 57 done\n",
      "Dish 58 done\n",
      "Dish 59 done\n",
      "Dish 60 done\n",
      "Dish 61 done\n",
      "Dish 62 done\n",
      "Dish 63 done\n",
      "Dish 64 done\n",
      "Dish 65 done\n",
      "Dish 66 done\n",
      "Dish 67 done\n",
      "Dish 68 done\n",
      "Dish 69 done\n",
      "Dish 70 done\n",
      "Dish 71 done\n",
      "Dish 72 done\n",
      "Dish 73 done\n",
      "Dish 74 done\n",
      "Dish 75 done\n",
      "Dish 76 done\n",
      "Dish 77 done\n",
      "Dish 78 done\n",
      "Dish 79 done\n",
      "Dish 80 done\n",
      "Dish 81 done\n",
      "Dish 82 done\n",
      "Dish 83 done\n",
      "Dish 84 done\n",
      "Dish 85 done\n",
      "Dish 86 done\n",
      "Dish 87 done\n",
      "Dish 88 done\n",
      "Dish 89 done\n",
      "Dish 90 done\n",
      "Dish 91 done\n",
      "Dish 92 done\n",
      "Dish 93 done\n",
      "Dish 94 done\n",
      "Dish 95 done\n",
      "Dish 96 done\n",
      "Dish 97 done\n",
      "Dish 98 done\n",
      "Dish 99 done\n",
      "Dish 100 done\n",
      "Dish 101 done\n",
      "Dish 102 done\n",
      "Dish 103 done\n",
      "Dish 104 done\n",
      "Dish 105 done\n",
      "Dish 106 done\n",
      "Dish 107 done\n",
      "Dish 108 done\n",
      "Dish 109 done\n",
      "Dish 110 done\n",
      "Dish 111 done\n",
      "Dish 112 done\n",
      "Dish 113 done\n",
      "Dish 114 done\n",
      "Dish 115 done\n",
      "Dish 116 done\n",
      "Dish 117 done\n",
      "Dish 118 done\n",
      "Dish 119 done\n",
      "Dish 120 done\n",
      "Dish 121 done\n",
      "Dish 122 done\n",
      "Dish 123 done\n",
      "Dish 124 done\n",
      "Dish 125 done\n",
      "Dish 126 done\n",
      "Dish 127 done\n",
      "0 times left to check!\n",
      "Total time: 3.087015\n",
      "Average time per call: 0.0241173046875\n"
     ]
    }
   ],
   "source": [
    "import datetime\n",
    "\n",
    "# To benchmark, try finding all of the paths from the correlator to each of the antennas, and time it.\n",
    "iterations = 1\n",
    "\n",
    "times_to_query = [1]\n",
    "\n",
    "total = 0\n",
    "\n",
    "print(f\"Dishes: {dishes}\")\n",
    "print(f\"Max time: {max_time}\")\n",
    "print(f\"Iterations: {iterations}\")\n",
    "\n",
    "for _ in range(iterations):\n",
    "    for i in range(len(times_to_query)):\n",
    "        time = times_to_query[i]\n",
    "        for dish in range(dishes):\n",
    "\n",
    "            success = False\n",
    "            while not success:\n",
    "                try:\n",
    "                    then = datetime.datetime.now()\n",
    "                    find_paths(name1=cor, name2=f'ANT{str(dish).zfill(6)}', time=time, avoid_type='')\n",
    "\n",
    "                    total += (datetime.datetime.now() - then).total_seconds()\n",
    "\n",
    "                    print(f\"Dish {dish} done\")\n",
    "\n",
    "                    success = True\n",
    "                except GremlinServerError:\n",
    "                    print(\"Uh oh! Backend exception!\")\n",
    "\n",
    "        print(f\"{len(times_to_query) - i - 1} times left to check!\")\n",
    "\n",
    "print(\"Total time:\", total)\n",
    "print(\"Average time per call:\", total / (iterations * len(times_to_query) * dishes))\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ]
}